[
  {
    "path": "posts/2021-08-08-why-2010-2012-matters/",
    "title": "Nothing to see here! Why 2010-11 and 2011-12 matter when it comes to the recent history of local authority finances",
    "description": "Let's clear up some misconceptions about data on local authority children's services spending over the past ten years. I've seen this discussion pop up now and again in relation to the Independent Review of Children's Social Care's Case for Change, but also in internal and external reviews of academic journal articles.",
    "author": [
      {
        "name": "Calum Webb",
        "url": "https://calumwebb.co.uk/posts/2021-08-08-why-2010-2012-matters"
      }
    ],
    "date": "2021-08-08",
    "categories": [
      "Social Policy",
      "Social Work"
    ],
    "contents": "\n\n\n\nLet’s clear up some misconceptions about data on local authority children’s services spending over the past ten years. I’ve seen this discussion pop up now and again in relation to the Independent Review of Children’s Social Care’s Case for Change, but also in internal and external reviews of academic journal articles.\nThe argument basically comes down to whether we can reasonably include spending data from before the 2012-13 fiscal year in analyses of how children’s services spending has changed, and how these changes have affected other factors like the numbers of children in need, or the rate of child protection plans, and so on. There are a couple of arguments for doing this, based on good reasons in theory, and an important contextual reason to not do this.\nWhy might we want to exclude data before 2012-13 from our analyses of children’s services spending?\nOn one side, you have those who argue that data from before 2012-13 should not be included in longitudinal analyses of local authority spending. There are two major reasons why you might want to do this that I am familiar with.\nThe first is convenience. The spending lines for children’s services (Table A1 in the Section 251 Returns) have been consistent since 2012-13, as has the underlying data format for the most recent years and, as such, one has the ability to quickly assess multiple years of data without having to wrangle with different data formats. This is particularly beneficial if you happen to need to do some analysis in haste.\nThe second, more important reason often given is that before 2012-13 different numbers of, and differently named, categories were used for grouping together types of local authority expenditure. This is true, and is the reason given by the Independent Review of Children’s Social Care for focusing on spending after 2012-13 in their Case for Change.1 For example, in 2010-11 one spending category was called “Sure Start Children’s Centres” but, since 2012-13, after a significant funding formula change, the closest matching category was called “Sure Start Children’s Centres and Early Years”.\nThere would clearly be a risk if we were to treat these categorisations of spending as the same over time. Increases in expenditure between 2010-11 and 2012-13, for example, might be the result of local authority accountants recategorising some spending to account for the overt inclusion of early years in the spending category.\nThere is some evidence that this is a valid concern. For example, the total expenditure recorded in the “Other children and families services” category in the 2011 to 2012 fiscal year drops from £401 million to £110 million in the next fiscal year, while the total expenditure recorded in the “Sure Start Children’s Centres/Sure Start Children’s Centres and Early Years” grows from £1.1 billion to almost £1.2 billion. How can we be sure that these changes aren’t just a result of changes in accounting practices? We can’t. So, in theory, it’s sensible to exclude the earlier 2010-11 and 2011-12 years to ensure a more valid comparison of how, say, children’s centres expenditure has changed over time… Right?\nSeparating spending categories in theory and practice.\nSadly, no. The boundaries between categories, especially those that encompass preventative and family support services, are so porous that there’s really no way of knowing whether spending on services is recorded consistently between local authorities or even within the same local authority over time, even if you exclude 2010-11 and 2011-12. Anecdotally, we know that they are not.\nTo take an example, Sheffield and Derby, which have very similar levels of deprivation, recorded dramatically different levels of expenditure per child for some of these categories in 2012-13. In Sheffield, the spend per child on ‘Sure Start Centres and Early Years’ was recorded as £115 per child but in Derby this figure was £63 per child. Meanwhile, spend on ‘Other children and families services’ was 3.25 times higher in Derby (£39.18 per child) than it was in Sheffield (£12.05 per child), and the spend on ‘Family Support Services’ per child was almost 25 per cent lower in Derby (£77.37 per child) than in Sheffield (£102.41).\nAre there real differences in policy and commissioning of services between Sheffield and Derby? Probably, yes. But depending on how we group these broad preventative and family support categories the difference between the two local authorities looks very different. If we compared them on just one category, for example, ‘Sure Start Children’s Centres and Early Years’, we’d find that Derby spends only 55 per cent of what Sheffield does. But if we were to include everything, including their vast difference in spending on ‘Other children and families services’, this changes to Derby spending 67 per cent of what Sheffield does. This 12 percentage point difference is not a trivial amount.\nEven if we want to leverage the benefits of having more comparable categories of spending by limiting our analysis to 2012-13 onward, this still leaves us with unreliable comparisons that will vary depending on the value judgements made by the analyst. This includes, for example, whether to include or exclude ‘Other children and families services’ as preventative, early help, and family support provision, for which 40 out of 152 local authorities in 2012-13 recorded no expenditure at all. Perhaps these local authorities merely categorised the same expenditure under another heading, whereas others felt it could not be classified in this way. Some categories, like Youth Justice, are even more difficult to allocate to a larger group.\nIt would be a great advantage for research if we were confidently able to precisely delineate spending between categories. We could, in theory, analyse whether some kinds of spending, for example, ‘family support’ as opposed to ‘services for young people’, are associated with better outcomes for some children and young people, e.g. teenagers. Sadly, this limitation of the data means we would not be able to be truly confident our results really showed this; at least some sensible grouping of expenditure is required regardless of whether we limit ourselves to data after 2012-13 or not.\nHow can we group expenditure categories to compare change over time?\nIn our 2018 article, Paul Bywaters and I argued that the safest way to include data from before 2012-13 in analyses of children’s services spending was to instead create three groups from the comparable meta-categories. These groupings of expenditure were: ‘safeguarding expenditure’; ‘children looked-after expenditure’; and ‘non-safeguarding, non-children looked after related expenditure’. Safeguarding expenditure includes everything under the ‘Safeguarding children and young people’s services’ heading and children looked-after expenditure includes everything under the ‘Children looked after’ heading.\nThese two headings very specifically and consistently point towards local authority children and families social work functions, commissioning and children’s services strategy, and local children’s safeguarding boards for ‘safeguarding expenditure’ and towards all costs associated with children looked-after for ‘children looked-after expenditure’. There is likely to be far less leakage between these two categories and everything else over time and between local authorities because of how closed their interpretation is.\nEverything else, on the other hand, is likely to leak between the remaining categories. What is considered a family support service in one local authority might be an ‘Other children and families service’ in another; what might have been a ‘service for young people’ at the start of the decade might be recast as something else by the end.\nThis grouping does not advantage the arguments of those pushing a specific agendas that the cuts have been larger or those arguing they have been smaller in any way. One could selectively pick only the category that happens to show the largest or smallest decrease over time if they wanted to do that.\nWe have actually found in more recent studies that this grouping is quite conservative when it comes to the scale of the cuts to public services, and have started to recommend its use as a sensitivity test if a study relies on a more precarious grouping of categories (for example, when trying to delineate between services for teenagers as opposed to services for very young children). What it does enable us to do is imperfectly bridge the differences in data between everything before 2012-13 and everything after 2012-13.\nCuriously, the footnotes of the Independent Review of Children’s Social Care’s Case for Change2 document imply that something almost identical to the above categorisation of expenditure was used to delineate between ‘statutory’ and ‘non-statutory’ spending.3 It is not clear why, then, they chose not to integrate spending from 2010-11 and 2011-2012 when this harmonised grouping makes it possible, and was deliberately used in past studies like ours for this explicit purpose.\nNothing to see here: Why shouldn’t we exclude 2010-11 and 2011-12 from our analyses of children’s services spending?\nAs Dr. Harriet Churchill documented in the Journal of Children’s Services far before we did in Local Government Studies in 2018, some of the largest cuts to children’s services came immediately after the 2008 recession and at the start of the Conservative-led coalition government. By sheer virtue of the magnitude of these cuts, and how little was left in the local authority central grant by 2013, we see a significant levelling off after this and, as you can see in the CWIP App, well into the future.\nOur original analysis showed the median expenditure per child against the three categories above between 2010-11 and 2014-15. If we ignore 2010-11 and 2011-12 momentarily, the paper would show that there was a £17 per child cut in all children’s services expenditure between 2012-13 and 2014-15 (around 2%),4 and a £46 per child cut in non-safeguarding, non-children looked-after expenditure (around 15%).\nBy contrast, if we changed our baseline to 2010-11, we would find that the decrease was £105 per child in all expenditure (around -11.35%) and £167 per child in non-safeguarding, non-children looked-after expenditure (a 38.3% reduction). In other words, comparing 2014-15 to a baseline of 2012-13 as opposed to 2010-11 masks cuts to services that are between 3.6 and 6.2 times larger in magnitude than those after 2012-13.\nLet’s update these figures with data from the CWIP App through to 2018-19. The table below shows average expenditure per child in local authorities in England, adjusted for inflation:\n\n\nhtml {\n  font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Helvetica Neue', 'Fira Sans', 'Droid Sans', Arial, sans-serif;\n}\n\n#lnlhmltwho .gt_table {\n  display: table;\n  border-collapse: collapse;\n  margin-left: auto;\n  margin-right: auto;\n  color: #333333;\n  font-size: 12px;\n  font-weight: normal;\n  font-style: normal;\n  background-color: #FFFFFF;\n  width: auto;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #A8A8A8;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #A8A8A8;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n}\n\n#lnlhmltwho .gt_heading {\n  background-color: #FFFFFF;\n  text-align: left;\n  border-bottom-color: #FFFFFF;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n}\n\n#lnlhmltwho .gt_title {\n  color: #333333;\n  font-size: 125%;\n  font-weight: initial;\n  padding-top: 4px;\n  padding-bottom: 4px;\n  border-bottom-color: #FFFFFF;\n  border-bottom-width: 0;\n}\n\n#lnlhmltwho .gt_subtitle {\n  color: #333333;\n  font-size: 85%;\n  font-weight: initial;\n  padding-top: 0;\n  padding-bottom: 6px;\n  border-top-color: #FFFFFF;\n  border-top-width: 0;\n}\n\n#lnlhmltwho .gt_bottom_border {\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n}\n\n#lnlhmltwho .gt_col_headings {\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n}\n\n#lnlhmltwho .gt_col_heading {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: normal;\n  text-transform: inherit;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: bottom;\n  padding-top: 5px;\n  padding-bottom: 6px;\n  padding-left: 5px;\n  padding-right: 5px;\n  overflow-x: hidden;\n}\n\n#lnlhmltwho .gt_column_spanner_outer {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: normal;\n  text-transform: inherit;\n  padding-top: 0;\n  padding-bottom: 0;\n  padding-left: 4px;\n  padding-right: 4px;\n}\n\n#lnlhmltwho .gt_column_spanner_outer:first-child {\n  padding-left: 0;\n}\n\n#lnlhmltwho .gt_column_spanner_outer:last-child {\n  padding-right: 0;\n}\n\n#lnlhmltwho .gt_column_spanner {\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  vertical-align: bottom;\n  padding-top: 5px;\n  padding-bottom: 5px;\n  overflow-x: hidden;\n  display: inline-block;\n  width: 100%;\n}\n\n#lnlhmltwho .gt_group_heading {\n  padding: 8px;\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  text-transform: inherit;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: middle;\n}\n\n#lnlhmltwho .gt_empty_group_heading {\n  padding: 0.5px;\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  vertical-align: middle;\n}\n\n#lnlhmltwho .gt_from_md > :first-child {\n  margin-top: 0;\n}\n\n#lnlhmltwho .gt_from_md > :last-child {\n  margin-bottom: 0;\n}\n\n#lnlhmltwho .gt_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  margin: 10px;\n  border-top-style: solid;\n  border-top-width: 1px;\n  border-top-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: middle;\n  overflow-x: hidden;\n}\n\n#lnlhmltwho .gt_stub {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  text-transform: inherit;\n  border-right-style: solid;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n  padding-left: 12px;\n}\n\n#lnlhmltwho .gt_summary_row {\n  color: #333333;\n  background-color: #FFFFFF;\n  text-transform: inherit;\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n}\n\n#lnlhmltwho .gt_first_summary_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n}\n\n#lnlhmltwho .gt_grand_summary_row {\n  color: #333333;\n  background-color: #FFFFFF;\n  text-transform: inherit;\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n}\n\n#lnlhmltwho .gt_first_grand_summary_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  border-top-style: double;\n  border-top-width: 6px;\n  border-top-color: #D3D3D3;\n}\n\n#lnlhmltwho .gt_striped {\n  background-color: rgba(128, 128, 128, 0.05);\n}\n\n#lnlhmltwho .gt_table_body {\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n}\n\n#lnlhmltwho .gt_footnotes {\n  color: #333333;\n  background-color: #FFFFFF;\n  border-bottom-style: none;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n}\n\n#lnlhmltwho .gt_footnote {\n  margin: 0px;\n  font-size: 90%;\n  padding: 4px;\n}\n\n#lnlhmltwho .gt_sourcenotes {\n  color: #333333;\n  background-color: #FFFFFF;\n  border-bottom-style: none;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n}\n\n#lnlhmltwho .gt_sourcenote {\n  font-size: 90%;\n  padding: 4px;\n}\n\n#lnlhmltwho .gt_left {\n  text-align: left;\n}\n\n#lnlhmltwho .gt_center {\n  text-align: center;\n}\n\n#lnlhmltwho .gt_right {\n  text-align: right;\n  font-variant-numeric: tabular-nums;\n}\n\n#lnlhmltwho .gt_font_normal {\n  font-weight: normal;\n}\n\n#lnlhmltwho .gt_font_bold {\n  font-weight: bold;\n}\n\n#lnlhmltwho .gt_font_italic {\n  font-style: italic;\n}\n\n#lnlhmltwho .gt_super {\n  font-size: 65%;\n}\n\n#lnlhmltwho .gt_footnote_marks {\n  font-style: italic;\n  font-weight: normal;\n  font-size: 65%;\n}\nTable 1: Change in Spending on all Children's Services Depending on Baseline Year\n    Year\n      All expenditure per child\n      Change (All, £-per-child) 2012-13 Baseline\n      Change (All, %) 2012-13 Baseline\n      Change (All, £-per-child) 2010-11 Baseline\n      Change (All, %) 2010-11 Baseline\n    2010-11\n\n1041\n\n\n\n\n2011-12\n\n920\n\n\n\n-121\n\n-11.6\n2012-13\n\n924\n\n\n\n-117\n\n-11.2\n2013-14\n\n913\n\n-11\n\n-1.2\n\n-128\n\n-12.3\n2014-15\n\n896\n\n-28\n\n-3\n\n-145\n\n-13.9\n2015-16\n\n880\n\n-44\n\n-4.8\n\n-161\n\n-15.5\n2016-17\n\n864\n\n-60\n\n-6.5\n\n-177\n\n-17\n2017-18\n\n866\n\n-58\n\n-6.3\n\n-175\n\n-16.8\n2018-19\n\n887\n\n-37\n\n-4\n\n-154\n\n-14.8\n\n\n\n\n\nhtml {\n  font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Helvetica Neue', 'Fira Sans', 'Droid Sans', Arial, sans-serif;\n}\n\n#fyomhcvqle .gt_table {\n  display: table;\n  border-collapse: collapse;\n  margin-left: auto;\n  margin-right: auto;\n  color: #333333;\n  font-size: 12px;\n  font-weight: normal;\n  font-style: normal;\n  background-color: #FFFFFF;\n  width: auto;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #A8A8A8;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #A8A8A8;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n}\n\n#fyomhcvqle .gt_heading {\n  background-color: #FFFFFF;\n  text-align: left;\n  border-bottom-color: #FFFFFF;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n}\n\n#fyomhcvqle .gt_title {\n  color: #333333;\n  font-size: 125%;\n  font-weight: initial;\n  padding-top: 4px;\n  padding-bottom: 4px;\n  border-bottom-color: #FFFFFF;\n  border-bottom-width: 0;\n}\n\n#fyomhcvqle .gt_subtitle {\n  color: #333333;\n  font-size: 85%;\n  font-weight: initial;\n  padding-top: 0;\n  padding-bottom: 6px;\n  border-top-color: #FFFFFF;\n  border-top-width: 0;\n}\n\n#fyomhcvqle .gt_bottom_border {\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n}\n\n#fyomhcvqle .gt_col_headings {\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n}\n\n#fyomhcvqle .gt_col_heading {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: normal;\n  text-transform: inherit;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: bottom;\n  padding-top: 5px;\n  padding-bottom: 6px;\n  padding-left: 5px;\n  padding-right: 5px;\n  overflow-x: hidden;\n}\n\n#fyomhcvqle .gt_column_spanner_outer {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: normal;\n  text-transform: inherit;\n  padding-top: 0;\n  padding-bottom: 0;\n  padding-left: 4px;\n  padding-right: 4px;\n}\n\n#fyomhcvqle .gt_column_spanner_outer:first-child {\n  padding-left: 0;\n}\n\n#fyomhcvqle .gt_column_spanner_outer:last-child {\n  padding-right: 0;\n}\n\n#fyomhcvqle .gt_column_spanner {\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  vertical-align: bottom;\n  padding-top: 5px;\n  padding-bottom: 5px;\n  overflow-x: hidden;\n  display: inline-block;\n  width: 100%;\n}\n\n#fyomhcvqle .gt_group_heading {\n  padding: 8px;\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  text-transform: inherit;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: middle;\n}\n\n#fyomhcvqle .gt_empty_group_heading {\n  padding: 0.5px;\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  vertical-align: middle;\n}\n\n#fyomhcvqle .gt_from_md > :first-child {\n  margin-top: 0;\n}\n\n#fyomhcvqle .gt_from_md > :last-child {\n  margin-bottom: 0;\n}\n\n#fyomhcvqle .gt_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  margin: 10px;\n  border-top-style: solid;\n  border-top-width: 1px;\n  border-top-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: middle;\n  overflow-x: hidden;\n}\n\n#fyomhcvqle .gt_stub {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  text-transform: inherit;\n  border-right-style: solid;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n  padding-left: 12px;\n}\n\n#fyomhcvqle .gt_summary_row {\n  color: #333333;\n  background-color: #FFFFFF;\n  text-transform: inherit;\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n}\n\n#fyomhcvqle .gt_first_summary_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n}\n\n#fyomhcvqle .gt_grand_summary_row {\n  color: #333333;\n  background-color: #FFFFFF;\n  text-transform: inherit;\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n}\n\n#fyomhcvqle .gt_first_grand_summary_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  border-top-style: double;\n  border-top-width: 6px;\n  border-top-color: #D3D3D3;\n}\n\n#fyomhcvqle .gt_striped {\n  background-color: rgba(128, 128, 128, 0.05);\n}\n\n#fyomhcvqle .gt_table_body {\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n}\n\n#fyomhcvqle .gt_footnotes {\n  color: #333333;\n  background-color: #FFFFFF;\n  border-bottom-style: none;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n}\n\n#fyomhcvqle .gt_footnote {\n  margin: 0px;\n  font-size: 90%;\n  padding: 4px;\n}\n\n#fyomhcvqle .gt_sourcenotes {\n  color: #333333;\n  background-color: #FFFFFF;\n  border-bottom-style: none;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n}\n\n#fyomhcvqle .gt_sourcenote {\n  font-size: 90%;\n  padding: 4px;\n}\n\n#fyomhcvqle .gt_left {\n  text-align: left;\n}\n\n#fyomhcvqle .gt_center {\n  text-align: center;\n}\n\n#fyomhcvqle .gt_right {\n  text-align: right;\n  font-variant-numeric: tabular-nums;\n}\n\n#fyomhcvqle .gt_font_normal {\n  font-weight: normal;\n}\n\n#fyomhcvqle .gt_font_bold {\n  font-weight: bold;\n}\n\n#fyomhcvqle .gt_font_italic {\n  font-style: italic;\n}\n\n#fyomhcvqle .gt_super {\n  font-size: 65%;\n}\n\n#fyomhcvqle .gt_footnote_marks {\n  font-style: italic;\n  font-weight: normal;\n  font-size: 65%;\n}\nTable 2: Change in Spending on Non-Safeguarding, Non-Children Looked-After Children's Services Depending on Baseline Year\n    Year\n      Non-SG, non-CLA expenditure per child\n      Change (Non-SG/CLA, £-per-child) 2012-13 Baseline\n      Change (Non-SG/CLA, %) 2012-13 Baseline\n      Change (Non-SG/CLA, £-per-child) 2010-11 Baseline\n      Change (Non-SG/CLA, %) 2010-11 Baseline\n    2010-11\n\n483\n\n\n\n\n2011-12\n\n383\n\n\n\n-100\n\n-20.7\n2012-13\n\n354\n\n\n\n-129\n\n-26.7\n2013-14\n\n329\n\n-25\n\n-7.1\n\n-154\n\n-31.9\n2014-15\n\n309\n\n-45\n\n-12.7\n\n-174\n\n-36\n2015-16\n\n277\n\n-77\n\n-21.8\n\n-206\n\n-42.7\n2016-17\n\n251\n\n-103\n\n-29.1\n\n-232\n\n-48\n2017-18\n\n234\n\n-120\n\n-33.9\n\n-249\n\n-51.6\n2018-19\n\n229\n\n-125\n\n-35.3\n\n-254\n\n-52.6\n\n\nTable 1 shows us that using 2012-13 as a baseline rather than 2010-11 hides around £117 in cuts in children’s services per child from the preceding two fiscal years. This means our end figure in terms of £s-per-head is more than 4 times smaller than it would have been if the baseline had been 2010-11. Using 2012-13 as a baseline results in a much more modest 4 per cent decrease in expenditure per child than the 14.8 per cent decrease when comparing 2010-11 to 2018-19.\nFor non-safeguarding, non-children looked after services spending the pattern is repeated. The absolute cuts to these services would be more than doubled from £125 per child to £254 per child if 2010-11 were set as the baseline. Similarly, the already dire 35.3 per cent relative decrease in spending would be inflated further to a 52.6 per cent one.\nConclusion\nIntentionally or not, excluding the results of the actions of the Conservative-led coalition government in their first two years of power, as the Independent Review of Children’s Social Care has in their Case for Change, paints a far more rosy picture of local authority children’s services finances in the recent past. Even if there are legitimate reasons for these years to be excluded, which does not appear to be the case here, the distorting effect it has on the representation of the policy and funding landscape should at least be acknowledged.\nWhat we gain for excluding these years in terms of the comparability of spending categories is minimal and remains problematic when comparing local authorities or change over time. By contrast, what we lose from the picture is an enormous shock to local authority spending power in a very short time frame. The start of the decade saw swingeing cuts, the effects of which local authorities are still contending with. What follows 2013 often looks like mild bloodletting in comparison.\nWell done if you made it this far, you might enjoy this dramatisation I made of your average Twitter debate about local authority children’s services finances as a Phoenix Wright case. I created this using objection.lol.\n\n\n\n\nPage 18↩︎\nPage 9↩︎\nThough I strongly disagree with family support, Sure Start, and services for young people being called “Non-statutory”, as one interpretation of Section 17 of the Children Act 1989 is that these services are a legal duty of local authorities.↩︎\nI did erroneously write this as a £15 cut per child in a tweet, because I was looking at the 2011-12 column and not the 2012-13 one.↩︎\n",
    "preview": "posts/2021-08-08-why-2010-2012-matters/nothing-to-see.png",
    "last_modified": "2021-08-09T10:04:32+01:00",
    "input_file": {},
    "preview_width": 1000,
    "preview_height": 1000
  },
  {
    "path": "posts/2021-08-03-sufficiency-and-efficiency/",
    "title": "Sufficiency is more important than efficiency if you want to improve public services",
    "description": "Things seemed to be going well. There was a general acknowledgment in the room that family support services and early help interventions were well worth investing in. And then, very slowly, the focus of the conversation started to change.",
    "author": [
      {
        "name": "Calum Webb",
        "url": "https://calumwebb.co.uk/posts/2021-08-03-sufficiency-and-efficiency"
      }
    ],
    "date": "2021-08-03",
    "categories": [
      "Social Policy",
      "Social Work"
    ],
    "contents": "\nI was recently in a (virtual) room presenting forthcoming research to a large group of people. I’m not able to disclose who they were, so I will just call them very important and powerful people™, to the extent that they, unlike me, could probably change things if they wanted to. I explained that the papers my colleagues and I have under review showed that the more money local authorities were able to spend on family support and early help services in a given year, the fewer children in need and 16-17 year olds entering care there were the following year. The research also showed that the more local authorities spent on these services, the more likely they were to get a ‘Good’ or ‘Outstanding’ Ofsted rating under any of the frameworks from the past ten years. (This research is still under review, but I hope to be able to share it with you soon.)\nThings seemed to be going well. There was a general acknowledgment in the room that family support services and early help interventions were well worth investing in. And then, very slowly, the focus of the conversation started to change.\n\n“Yes, we all agree that we need more early help and family support. But we have to make sure that we’re using the most effective services with the best quality evidence.”\n\nI could go on for the length of a book about the problematic aspects of the term “best quality evidence” or how “effectiveness” is measured, never mind the fact that all public spending is accused of being inefficient by default. But there is something more fundamentally wrong with the tendency of very important and powerful people™ to focus first on efficiency. This came to mind today after seeing this hilariously self-defeating motivational cartoon.\n\n\n\nSufficiency and efficiency\n\n\n\nDespite our obsession with efficiency and its cousin, value for money, these things can be a distraction when focused on in contexts where there are insufficient resources in the first place. In the (de)motivational cartoon, the little man with the ladders achieved his objective of looking over the wall even with his horrendously inefficient use of wall-scaling technology. His lack of efficiency was made up for by the sufficiency of the resources provided to him. I’ve taken the liberty of extending the possible combinations of resources and efficiency that this cartoon implies above.\nAs shown in the (de)motivational cartoon, sufficient resources can usually compensate for inefficiency (A). Of course, it would be great if we could always use our resources in the most efficient way possible (B). This means that we don’t need to allocate more resources than we absolutely need to to achieve our objectives — a nice added bonus in addition to achieving our objective.\nBut what if we don’t have enough resources in general? Despite a clear difference in efficiency, neither approach C nor D reaches the objective of scaling the wall. This adds additional complications in trying to assess efficiency when neither approach has sufficient resources.\nBy definition, an efficient approach is the one the reaches the same objective with the least amount of resources. B is clearly more efficient than A. They both reach the same binary objective (climbing the wall) with different amounts of resources (ladders).\nBut in the case of C and D, we can’t get a reading on which is more efficient because neither achieves the objective, at least not without shifting the goalposts. We could, for instance, measure how close each approach got to the objective, but this is rarely something that can be operationalised or recorded when we translate the metaphor to public services, nor would such a translation be particularly meaningful to the person concerned or the service.\nSufficiency of resource is often a pre-requisite to being able to achieve an objective and identify the efficiency of one approach over another. It is considered quite crude or naive to suggest that a system would work much better with an uplift of resources alone, even if what is being done is fundamentally unchanged (regardless of how efficient or inefficient it may be). For many things though, enough really can be enough. If our focus is on improving efficiency, we should also be mindful that we risk misdiagnosing a fault in the system as a fault in the approach when working in contexts of insufficient resources. The consequences of this misdiagnosis can be highly disruptive.\nDoing the right thing\n\n\n\nThere are exceptions to every rule and the most important one here is that sufficient resources can only reach an objective if they are being used correctly. Needless to say, if you throw more resources at doing the wrong thing you will only end up doing it more wrongly. This is something I first heard from Kathy Evans, who informs me she first heard it from Simon Caulkin who, in turn, credits it to systems theorist Russell Ackoff. Ackoff is credited in Caulkin’s article as saying:\n\n“When we make a mistake doing the wrong thing and correct it, we become wronger. When we make a mistake doing the right thing and correct it, we become righter. Therefore, it is better to do the right thing wrong than the wrong thing right.”\n\nIf you are using your ladders to dig holes you are, very clearly, doing something wrong. If you are very efficient at digging holes with ladders, you are only going to be working very quickly towards the wrong objective. And if you have a large amount of resources, you are going to be doing this a lot.\nWhat should we focus on when it comes to improving public services?\nBased on the above logic, we might list the order our priorities should be in as follows:\n1. Is what we’re doing right?\nAre we doing things that are moving us in the right direction, towards our objective? If not, it won’t matter how efficient we are or how sufficient our resources are, because they’ll just take us further away from our goal.\n2. Is it insufficiency of resources holding us back, or lack of efficiency?\nDo we actually have enough resources to translate us doing the right thing into a meaningful outcome? Even if we made what we are doing more efficient, would our resources be enough to translate that into real change?\n3. Can what we are doing be made more efficient?\nIf we’re doing the right thing, and we have enough resources for it to reach a meaningful objective, can we make it any more efficient?\nHow often, when you speak to very important and powerful people™, do you witness the focus shifting on to the third point with little interrogation of first and second? After ten years of austerity, which saw an average reduction of more than 50 per cent per child in spending on early help and family support, with a post-Brexit, post-Covid-19 recession looming in the distance, the question of sufficiency of resources has never been more important.\nThe Conservative-led government has been fond of trumpeting their £14million investment in Family Hubs as a response to the crisis in children’s social care, with little challenge on the sheer insufficiency of this amount, which equates to only around 0.5 per cent of the family support and early help funding the average local authority has seen cut from their budgets over the past decade. At this point it likely doesn’t matter so much how efficiently we prop our ladders up against the wall, insufficient resources mean there is little chance of public services surmounting the obstacles between them and their objectives. This, in turn, makes them ever more vulnerable to political attacks.\nWhen climbing the wall means keeping children safe, with their parents when possible, and ensuring they have the best quality of life, let’s make sure we can do that first; then we can worry about optimising the number of ladders we use.\n\n\n\n",
    "preview": "posts/2021-08-03-sufficiency-and-efficiency/sufficiency-and-efficiency-preview.png",
    "last_modified": "2021-08-09T10:07:08+01:00",
    "input_file": {},
    "preview_width": 878,
    "preview_height": 878
  },
  {
    "path": "posts/2020-08-20-inequality-cwi/",
    "title": "Socioeconomic inequalities in child welfare interventions are five times stronger in unequal and affluent local authorities than they are in equal and deprived local authorities. Why?",
    "description": "One of the articles we had published in Children and Youth Services Review this year highlighted a new finding that the social gradient in child welfare interventions was predicted to be as much as five times stronger in local authorities with both lower-than-average deprivation and higher-than-average income inequality than it was in local authorities with higher-than-average deprivation and lower-than-average income inequality. This blog post explores one reason why this might be.",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-08-20",
    "categories": [
      "Social Work",
      "sociology"
    ],
    "contents": "\n\nOne of the articles we had published in Children and Youth Services Review this year highlighted a new finding that the social gradient in child welfare interventions was predicted to be as much as five times stronger in local authorities with both lower-than-average deprivation and higher-than-average income inequality than it was in local authorities with higher-than-average deprivation and lower-than-average income inequality.\nThis blog post explores one reason why this might be, but before discussing this, it’s important to review what we mean by the social gradient, income inequality, how we measured these, and how local income inequality differs from many of the ways we think about ‘inequality’.\nThe technical bit…\nThe social gradient in child welfare interventions is a measure of the how much intervention rates - such as children being placed on child protection registers, or being taken into care - differ according to family socioeconomic status, which is largely measured by their economic and material wellbeing. Sometimes this is measured at different levels so, for example and in our ‘Untangling Child Welfare Inequalities’ paper, we look at the social gradient in neighbourhood (approx 1500 people) intervention rates based on neighbourhood deprivation levels.\nIn order to do this, and to standardise certain things to control for ‘confounding factors’ - that is, other features of neighbourhoods the effect of which we want to control for so we don’t confuse it with the deprivation effect - we created a way to express the social gradient in a single number that represents how many times we would expect the rate of child welfare interventions to increase or decrease for every one standard deviation increase in deprivation, measured by the Indices of Multiple Deprivation. A one-standard deviation difference is about the same to comparing an ‘average’ deprivation neighbourhood with one that is ranked in the middle of the third most deprived of all neighbourhoods.\nFor simplicity’s sake, I refer to a minus 1 change in standard deviation as an ‘average low deprivation’ neighbourhood, and plus one standard deviation change as representing an ‘average high deprivation’ neighbourhood. It’s best to not overthink it too much and just consider it us comparing low, average, and high deprivation neighbourhoods in a way that doesn’t mean we focus on the extremes. See the graph below for a more simple example of local authority deprivation. We scaled up the same logic to local authorities - so an ‘average high deprivation local authority’ would be one with a deprivation score one standard deviation, and did the same for ‘income inequality’.\n Image showing distribution of LA deprivation as a standardised distribution, with examples of average low-, average high-, and average deprivation.  \nWhat does that all mean? Well, it means if we had a social gradient of 2, we would be saying that ‘we would expect the rate in a high deprivation neighbourhood to be twice (2 times) as high as the rate in an average deprivation neighbourhood’. Basically, that the rates of intervention double. The multiplied change would be the same on average for the comparison between an average neighbourhood and a low-deprivation neighbourhood. This basically means that the higher the social gradient number is, the larger socioeconomic inequalities there are in that local authority.\nSo, what would we predict the social gradient to be in a local authority with high-deprivation and low-income inequality? The answer in our paper is about 1.26 for children looked after rates, and a little higher for CP plans and Children in Need rates. So, an average neighbourhood would have 1.26 times higher children looked after rates than a low-deprivation neighbourhood, and a high-deprivation neighbourhood would have 1.26 times higher children looked after rates than an average deprivation neighbourhood. This can also be read as a 26% increase.\nIn a low-deprivation, high-income inequality local authority, we calculate an average social gradient of 2.29 for children looked after rates. Meaning that we would expect the rates of children looked after to more than double when we compare average deprivation to low-deprivation neighbourhoods and high-deprivation to average deprivation neighbourhood. Again, this can be read as 129% increases in rates when comparing increases in deprivation (which is where our ‘five times greater’ comes from).\nThe shape of local income inequality\nBefore we raise a few ideas that start exploring why this might be the case, it’s important that we understand something crucial about what within-local area income inequality looks like. Paradoxically, more deprived local authorities tend to have greater within-area income inequality than less deprived local authorities. The image below shows the income distributions we used to calculate income inequality using the Gini coefficient, which ranges from 0 to 1 where 1 is completely unequal (one household gets 100% of the income) and 0 is completely equal (everyone gets an equal amount of income).\n\n Simulated gross household income distributions for local authorities in England and Wales. Income distribution estimates from CACI Ltd. Paycheck data. \n\nWhat this graph is saying is that areas with a higher proportion of the population on a low-income also tend to be more unequal; of course these areas also tend to be more deprived. Our conventional understanding of inequality tells us this shouldn’t be the case: places like Kensington and Chelsea should come out as the most unequal. They don’t for a couple of reasons: firstly, we tend to confuse wealth inequality - differences in people being able to afford huge houses or apartments and having massive amounts of money invested - with income inequality when imagining what inequality looks and feels like, despite them being two different but related things.\nSecondly, we tend to think about national or even transnational/global-level inequality when we think about inequality. Unless Jeff Bezos has developed the power of multilocation he can only, while contained within his mortal body, exist and have his income recorded (or not, whichever the case may be) in one place at a time. Millionaires and billionaires are not equally distributed to Sunderland in the same proportions as they are to Los Angeles, New York, and Inner London (or the Bahamas), and for these reasons, local area income inequality looks very different to global inequality.\nLocal area income inequality using the Gini method is therefore largely determined by the ratio of low-income households to middle-income households, rather than the presence of obscene wealth/income, as we see in our graph above. In the most unequal places (represented by the lighter shades of blue), we have a much larger proportion of ‘low-income’ households - the first ‘peak’ - but only a slightly lower proportion of ‘middle-income’ households (relative to how many more low-income households there are). This is probably because job security, hours, salaries, and so on are more standardised across the country for middle-income jobs than they are for low-income jobs. In many places, you literally cannot live in the local authority if your income is below a certain level - you might then be forced out by the housing market, or may be in receipt of comparatively large cash transfers like housing benefit that try and prevent such things from happening.\nIn sum, more income unequal local authorities (under our estimates) tend to have a bigger ratio of low-income households to middle-income households.\nLived experience gaps and organic empathy\nHow do we make sense of this effect? One particular bugbear of mine is that income inequality is often brought up as something detrimental to society but there’s comparatively little theorising about the mechanisms behind how this happens. The example below is more focused on how inequality effects might emerge in practice relationships, but there are likely far more factors that are not considered here, including how local income inequality might constrain the capacity of local authorities to provide services that support families on a low income if they aren’t able to as efficiently raise funds from the local population through council taxes, business rates, and other sources of revenue.\nLet’s imagine the position of a social worker (and other professionals in social work) in a high-income inequality and a low-income inequality local authority, based on what we know about what this means above. The salaries of social workers are probably too low in general considering the strain of the job and number of hours, but most people would agree that they fall somewhere in that ‘middle-income’ range of the distribution, especially after the newly qualified stage. They certainly would fall more under the second peak than they would under the ‘low-income’ first peak (of between £5k and £30k per year, gross, per household - keep in mind that the second peak represents total gross household income, so in many cases includes two adults, I am not suggesting that I think social workers earn £80k a year on average).\nAs discussed in the above section, paradoxically, more deprived local authorities tend to be more unequal because of the gap between the proportion of middle-income households and the proportion of low-income households. Now let’s consider what you can buy for social worker’s salary in a high-income - not wealth! - inequality local authority compared to a low-income inequality local authority.\nFor starters, a social worker can probably be much more ambitious with property, either rented or bought, if they live in, say, Sunderland instead of Kingston upon Thames. This might also translate into opportunities related to schools for their kids and the areas they live in general. Even the most deprived local authorities tend to have their own microcosm of ‘comfortable’ neighbourhoods for middle-income professionals that are found everywhere: teachers, doctors, dentists, civil servants, and social workers.\nContrast this to the options afforded to social workers who work in the less income unequal local authorities, the places that tend to be less deprived and therefore more expensive. The property market may be out of reach, or much harder to reach, which will restrict where they can live, and therefore there would likely be many parts of life that they are priced out of.\nRather than the more locally income equal places bringing up the quality of life that low- and middle-income households can afford by redistributing income from the top (which doesn’t happen in local-area equality), it squeezes all households closer together creating more ‘equality’ but probably not a better quality of life overall. The very low-income households have their incomes nudged up (either through London weighting or rent-based housing benefit), but this probably doesn’t improve peoples’ quality of life; it just props up a broken housing market. Middle-income households may have their incomes nudged up a little bit, especially with things like London weightings in affluent parts of London, but probably not nearly enough to offset the additional costs of living in an ‘affluent’ county/city.\nSo, where am I going with this? Basically, my theory is that the lived experience of a social worker - their experience with housing, where they can afford to live, class discrimination, schooling, quality of life - is probably more similar to that of the people they work with in the more ‘income equal’ local authorities, despite the fact that the way that this equality emerges is somewhat counter-intuitive and perverse. In more locally income-unequal places, middle-income households, which include many social workers, are better able to carve out a quality of life that looks very different to those of the low-income households within their city or county.\nThis, I suspect, makes it harder for some people to develop empathy, poverty-aware practice, and perhaps other things associated with child welfare inequalities organically, through living in the same places, sending children to the same schools, and facing the same financial difficulties. Through experiencing the same experiences. As social workers are burdened with more and more paperwork, the capacity to build this empathy through direct work also reduces. This may, of course, all be completely incorrect nonsense - the truth is probably a combination of many factors - but I think we have to start somewhere in understanding how inequality subtly shapes injustice in the child protection system.\nWhere from here?\nWe argue in our paper that this means that local children’s services solutions, with all the best will in the world, can never tackle socioeconomic inequalities in child welfare intervention rates on their own - neither can individual social workers. They can make strides, certainly, but there are structural patterns reinforced by national policy that create the contexts in which unequal likelihoods of intervention flourish. Local income inequality is one of these.\nAll the evidence suggests that reducing the deprivation and poverty that people face will reduce the rates of social work intervention, but this alone does not change how socially just children’s social services are - poorer neighbourhoods would still have higher intervention rates. The enormous variation in the proportion of households on a low income across the country, in contrast to much lower variation of middle-incomes, may be leading to even more unintended consequences as our material lives create figurative and literal barriers between us, sowing more inequality into all of our social engagements. This, for a profession that prides itself on human connection and relationships, should be particularly worrying.\nYou can read the full article this blog is based on here. Email c.j.webb@sheffield.ac.uk if you do not have access.\nYou can read the final report from the Child Welfare Inequalities Project here. The Child Welfare Inequalities Project was funded by the Nuffield Foundation.\n\n\n\n",
    "preview": "posts/2020-08-20-inequality-cwi/img/ineq/sweet-temptation-prev.jpeg",
    "last_modified": "2021-08-02T16:22:35+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-08-13-a-few-lines-of-code/",
    "title": "A few lines of code separate quantitative analysis from predictive analytics",
    "description": "The programming equivalent of a hair's breadth stands between the code required to analyse trends, associations, and inequalities in data and the code required to turn these into contextless, essentialist predictions.",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-08-13",
    "categories": [
      "sociology",
      "Social Work"
    ],
    "contents": "\n An image of a dog wearing glasses, “typing” on a tablet computer.  \nThe programming equivalent of a hair’s breadth stands between the code required to analyse trends, associations, and inequalities in data and the code required to turn these into contextless, essentialist predictions. This is, of course, something of a simplification - it may not hold true when talking about very complex machine learning models designed for producing images or sounds - but within the context of the kinds of predictive analytics used in governance, including the algorithm that caused A-level results chaos today, it is, essentially, true.\nSomeone who has experience working with both data analysis and predictive analytics in more general programming languages can probably even name the functions required to get from one to the other. It is pretty much a given. In fact, we use predictions frequently in quantitative analysis to check whether outliers are skewing our model estimates or to visualise the impact of one variable on our outcome of interest. For example, see below how I have visualised the predicted rates of children being taken into care, classed ‘in Need’ under Section 17 of the Children Act 1989, or placed on a child protection plan, using a complex multilevel negative binomial regression model that controls for many other factors (see our paper here for full details).\n\n\n\n\nFigure 1: Incidence rate and incidence rate ratio predictions from a set of three negative binomial models.\n\n\n\n\nThe two different applications, despite comprising of probably more than 90 per cent of the same code, tend to be used for polar opposite purposes. Building a model based on good theory, clear hypotheses, and representative data, can tell you about the inequalities that exist in the data, and in the system that produces this data. The goal is to test and understand, usually with an aim to show something that shouldn’t be happening. The model can tell you about how black people are disproportionately stopped and searched by the police, even after controlling for many other factors; it can tell you about how children living in the poorest ten per cent of neighbourhoods are ten times more likely to be taken into care; and it can tell you about how poverty and preferential treatment and resourcing of certain types of schools impacts young people’s chances of achieving the qualifications they need to pursue their goals.\nThe exact same model, with a flourish of code, can be turned into a tool for predicting what we would expect given these patterns and associations - even when we know or suspect that what the system produces is fundamentally unjust. Test and understand is no longer the primary goal. Predict as best as possible is. This is, presumably what’s happened with the great A-level results adjustment debacle today. At least, what happened hits all the right beats.\nInstead of telling us how very fundamentally unjust structures twist and distort children’s chances of having their abilities recognised, or strip them of opportunities to fully develop their skills and intellect through schooling, the use of predictive analytics and automated-decision making stands in for the unjust system and, in many cases, amplifies it. Whatever models were produced to create this disaster could have told us about how young people who live in deprived areas are unjustly robbed of the chance to fulfil their academic potential; how state-run schools are under-resourced and, as a consequence, forced to take on larger and larger class sizes. We could have even used them to level the playing field a bit for young people who face multiple disadvantages, those who we have failed in the design and resourcing of our education system.\nInstead, the predictive models made sure that the system got its due, and that those with the temerity to be born into poverty or to be born as an ethnic minority - or both - suffered the full brutality of society’s flaws. That those born with the good sense to be white, wealthy, and to parents with friends in high places, weren’t deprived of their extra slice of pie. They ensured that the tilting of the table was simulated even when the table had been thrown off the edge of a cliff.\nA part of me is an awful person, who relishes the fact that this gaming of the system through pseudo-technomancy caught in its net the same people who often benefit from these systems and do nothing to stand against, or even actively support, the rise of automated inequality that ruins the lives of millions of poor people every year. Largely, it got them because the approach the engineers (or whatever) used appeared to be geographical, not individual; I suppose they would be the “false positives” in this case. How many false positives have already been swept up by automated job application funnels, housing application filters, child protection alarms, police facial surveillance systems, and automated criminal justice sentencing tools?\nOf course, it is wrong to be happy about this because those young people have done nothing wrong. They did not deserve to have their results downgraded any more than others did, so any victory over the relentless march of ‘AI’ is pyrrhic at best. It is good that their parents are waking up to the dangers of predictive analytics, I only hope that many of them in privileged positions will recognise that this awful day for their families has been an awful decade for many others and that, when they get their way to reverse what has happened (which they will), we don’t just go back to ‘trialling’ these deeply flawed technologies on the lives of those who can’t fight back.\n\n\n\n",
    "preview": "posts/2020-08-13-a-few-lines-of-code/img/few-lines/img1-dog-prev.jpeg",
    "last_modified": "2021-08-02T15:52:58+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-08-05-anti-racist-and-anti-poverty-social-work-must-be-both/",
    "title": "Anti-racist and anti-poverty social work must be both: Child Welfare Inequalities at the intersection of race and class",
    "description": "Our new research published in Children and Youth Services Review shows how the social gradient varies based on ethnic population, and what sociological theories and policy analysis might explain why this happens. This blog discusses some of the key messages for social work.",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-08-05",
    "categories": [
      "Social Work",
      "sociology"
    ],
    "contents": "\n\n\n\nThis graph shows how existing ethnic disproportionality in child welfare interventions would affect the demographics of children taken into care in three differently deprived neighbourhoods if all had an equal size population from each ethnic group. (Click here to view a colourblind friendly version).\n\nA casual observer of debates in child protection is likely to be familiar with the following two observations: first, that Black children are disproportionately over-represented in the rates of children in care and, second, that poor children are disproportionately over-represented in rates of children in care. If your expertise and interest stopped there, you might conclude that the two are one and the same. More Black children are living in poverty and therefore more children in care are Black.\nYou might then, reasonably, conclude that both injustices could be tackled in one fell swoop, or at least that there is no harm in tackling each in their own realm because the end result will be a benefit to all oppressed groups. Lift all people out of poverty, or tackle structural racism, and both injustices would be remedied. An anti-racist agenda and an anti-poverty agenda, either will help all affected by child welfare inequalities. But what if the result was that action on one without the context of the other could actually worsen inequity?\nA more-than-casual observer of ethnic disparity in the child protection system will tell you that all is not as straightforward as it seems. For example, that in poor neighbourhoods, the rates of Black children in care are actually significantly lower than the rates of White children in care; and that in more affluent neighbourhoods the opposite is true. This is well documented in international literature, with the same patterns appearing in the United States and the United Kingdom. Similar patterns between people with Western coloniser heritage and indigenous heritage also appear in countries like Canada, Australia and Aotearoa New Zealand.\nIt’s important to state that this cannot be explained by different ethnic groups being more likely to experience child abuse and neglect. The Office for National Statistics report that, even before controlling for different exposure to poverty and stressors that may increase the risk of abuse or neglect, Black respondents to the Crime Survey for England and Wales were less likely to report having experienced child abuse (0.75:1), and Mixed Heritage respondents were only marginally more likely to report experiencing abuse (1.2:1). By contrast, we estimated the rates of children on Child Protection Plans or in care were, on average, 1.2 times higher for Black children than White children, and 1.6 times higher for Mixed Heritage children than White children. Plainly put, ethnic disproportionality is likely a predominantly service-side inequality, and requires social workers, policymakers, directors of children’s services, and the profession at large to examine the way that social work and wider allied agencies reproduce ethnic inequalities.\nThere are, of course, far more ethnic groups to consider than those discussed above, of which we look at eleven in a new article in Children and Youth Services Review. Here, where our words are more limited, we want to focus on the differences in rates of children in care between the Black British child populations (with African, Caribbean, and ‘Other’ heritage), the largest Mixed Heritage population in the UK (‘Mixed Heritage (Other)’), and the White British child population, to illustrate how an intersectional understanding of child welfare inequalities is essential for informing effective policy and practice responses, and how it aligns with sociological literature about class, race, and parenthood in Britain.\nEthnicity and the social gradient\nWhat we see from our data is that the social gradient, that is, the inequalities in child protection across the deprivation spectrum, differs significantly depending on ethnic population.\nTo try and quantify the social gradient, we calculate a single number that represents the multiplicative change in the rate of intervention between a neighbourhood with ‘average’ deprivation and a neighbourhood with ‘high deprivation’. This is roughly the same as splitting neighbourhoods into three groups, from least deprived to most deprived, comparing the average of the middle group with the average of the most deprived group, and answering ‘how many times more children are we likely to see experiencing an intervention in the more deprived group’. We used children’s services data for 836 Middle Super Output Areas from a representative sample of 18 local authorities in England to do this.\nFor White British child populations, the social gradient was 3.89 meaning that, on average, the rate of White British children in care in a high deprivation neighbourhood would be nearly 4 times higher than what it is in an average neighbourhood. This also works the other way around. In a ‘low deprivation’ neighbourhood the rate of children being taken into care would be only around 1/4th the rate of the average neighbourhood, or 1/15th the rate of the high deprivation neighbourhood.\nFor Black African child populations the social gradient was only 1.12 on average. In other words, the rate of children in care in a high deprivation neighbourhood would only be around 1.12 times higher than it is in an average neighbourhood. For Black Caribbean child populations the rate was 1.88 and for Black Other child populations it was 0.96, so it’s not quite as simple as saying the social gradient doesn’t exist for all Black ethnic groups. However, even in the case of Black Caribbean population, the social gradient is still less than half of what it was for White British populations.\nFor the Mixed Heritage (Other) ethnic group, the social gradient was approximately the same as the White British social gradient, but their rates were also between 1.7 and 3.4 times higher than the White British population’s at any point on the scale of deprivation; far higher than their marginally higher likelihood of reporting experiencing abuse or neglect would suggest.\nThis shows us that, when considered together, ethnic and class inequalities are far more complicated than they might first appear. But responding to these inequalities with effective anti-racist and anti-classist policy and practice requires more than just description. It requires us to understand how race and class work together to create injustice in children and families social work.\nRacialised wealth and racialised poverty\nWe argue that these inequalities emerge at least in part as a product of the way that poverty and affluence is interpreted within the contexts of ethnic/racial identity, as well as through the differing obligations found in anti-discrimination legislation, and there is a wealth of literature to this effect. Complex inequalities may arise as a result of the interplay between cultural representations of racialised class identities, histories of institutionalised racism, physical and symbolic violence directed towards interracial relationships, and the disconnect between anti-racist and anti-classist policies and practice.\nThe most straightforward example of the representation of racialised class identities comes from television and popular media. Consider, for example, programmes like Benefits Street or characters like Vicky Pollard (“Yeah, but no, but”) or Lauren Cooper (“Am I bovvered?”), and the use of the word ‘chav’. These are not just parodies of Whiteness in general, they are parodies of poor White people - particularly poor White mothers with Mixed Heritage children - that are seeped into our national consciousness. They are presented as feckless, idle, criminal, and undeserving of compassion, and are subject to many of the same stereotypes that are applied to young Black people, but there is usually limited discussion of the way that these narratives shape the treatment of young White mothers living in poverty.\nIn the space of affluence, consider the cultural representation of affluent Black people - particularly affluent Black men. Black faces are normalised in cultural representations of poverty, usually presented through the gaze of the ‘White saviour’, and the representations of routes to wealth for Black people are commonly positioned within narratives of physical over intellectual effort and ability, as well as with criminality, drug dealing, and gang violence. In other words, poverty has historically been presented as the norm for Black families, and a deviation for White families.\nBlack men in relationships with White women have been particularly vilified throughout history, along with their partners, and oppressed physically, legally (in the form of anti-miscegenation laws in the USA), and symbolically in cultural representations of their motives. The Fletcher Report in 1930 famously stated that White women in relationships with Black men were either ‘mentally weak’, ‘prostitutes’, ‘young and reckless’, or forced into marriage through pregnancy. These social attitudes are far from consigned to history. One study in the US, as recently as 2008, found that 17 per cent of White men and 19 per cent of White women responded that they thought it ‘was not a good idea’ for White men to have children with Black women or for White women to have children with Black men, respectively. A further 36 per cent of men, and 45 per cent of women, responded that they ‘wouldn’t [have children with a Black woman/man themselves], but that it was okay for others’.\nA history of institutionalised and systemic racism, racially segregated neighbourhoods, and racist cultural stereotypes coalesce into systems that place Black people under increased social surveillance and suspicion, not just by the state but by their neighbours, especially when they live in predominantly White, affluent neighbourhoods and send their children to predominantly White schools. A similar kind of surveillance exists for White mothers living in poverty, as their uses of state support - that they are entitled to - and their relationships, are closely monitored and scrutinised.\nThe Obligation Disconnect\nIn both of these examples, the interpretation of class and poverty is heavily contingent on race, and vice versa. In both, too, children of Mixed Ethnic Heritage are disadvantaged in unique ways that are rarely discussed. In law and social work education the two matters are often dealt with outside the lens of the other. Anti-racist practice has a longer history in social work education (although it remains a marginal concern), while anti-poverty or anti-classist social work practice and education has been patchwork at best.\nFurther, social class is not a protected characteristic under anti-discrimination law and, as such, there is less of an imperative for anti-classist practice to be pursued seriously; especially under strained budgets, high workloads, and the depressing regularity that tabloids and politicians accuse social workers of being ‘overly politically correct’ and obsessed with ‘isms’ and ‘ologies’.\nThis combination of sociological factors may help us better understand why there are 15 times more White British children in care in high-deprivation neighbourhoods than there are in low-deprivation neighbourhoods; why rates of care for Black children are between 3.3 and 4 times higher than White British children’s in low-deprivation neighbourhoods, but the opposite in high-deprivation neighbourhoods; and why Mixed Heritage children seem to face the sharp edge of both class discrimination and structural racism. Thinking more critically about the racialised notions of class may be essential for uncovering and rectifying hidden biases in child protection, and confronting the long shadow of racism, anti-miscegenation attitudes, stigmatisation, and our contextual interpretations of poverty is essential.\nAs yet, there is far too little good research in the UK about race, class and the care system to be certain whether our theories are correct, and the data we rely on are far from perfect. All we can do is say that our analysis helps illuminate disturbing patterns in child welfare interventions, and that these patterns are consistent with the history of racism and oppression in our society. Social work has not escaped this.\nRoutine data is still not collected on parents’ socioeconomic circumstances, and we can see our society slipping back into a reluctance to call racism by its name as the media collectively move on from the Black Lives Matter protests. We would encourage you to reflect on your thoughts and, if you are a social worker, your practice through a racialised class or intersectional lens. How do you think about young mothers living in impoverished areas and how does their ethnicity (and the ethnicity of their children) affect your interpretation? What specific training or education have you had on Whiteness, multiethnic heritage, and poverty? Are you immune from the pejorative narratives of Benefits Street and Little Britain? Why might wealth shield White British families from social work intervention, but not their Black neighbours? How might institutionalised and systemic racism in other agencies and processes associated with children’s services create ethnic inequalities in child protection?\nThe Consequences of Intersectional Injustice\nBased on our findings, what would happen if we just tackled economic inequalities without deliberate efforts to reduce ethnic inequalities? The rates of children in care would drop massively for White British and Mixed Heritage children, and a few other ethnic minority groups would see some reductions, but the rates for Black African and Black Other children would probably stay much the same. The rates for Black Caribbean children would decrease less than half the amount that they would for the White British children. The end result would be that ethnic inequalities would increase.\nHow about if we just pursued ethnic proportionality without attention to class and poverty? If you want proportionality in overall rates, Black children who are already disproportionately under-represented in poor neighbourhoods would need to be further under-represented, creating greater ethnic inequalities within similarly deprived neighbourhoods. If you want greater proportionality within similarly deprived neighbourhoods, you would, paradoxically, need to intervene more frequently with Black populations. This would increase ethnic disproportionality and the social gradient overall.\nAnd what of the Mixed Heritage children for whom inequalities will persist under either option? Under the former, there would still be a gulf of difference between them and their peers from other ethnic groups and, in the latter, the same would be evident between richer and poorer counterparts.\nThe evidence tells us that anti-racist social work should be pursued with explicit reference to the link between class and race, and that anti-poverty social work must not assume all racial disparities can be explained by economic disparity. Tackling either alone will tackle neither. The problem is extremely complex, as we discuss in the paper, but that is not an excuse to water it down or to seek shortcuts. Moreover, there are other important intersections to consider: gender, nationality, sexuality, and disability to name but a few. Perhaps we might be better served by thinking about Intersectional Justice, and how we create policies and practice to achieve this.\nAchieving Intersectional Justice\nIn order for social work to achieve racial and class justice it is necessary for it to achieve both. Resources for doing so already exist in the form of anti-oppressive practice, but it must be made clear that this kind of anti-oppressive practice cannot be achieved when racial equality and class equality are treated as separate agendas. When they are, intersectional injustice remains hidden. Moreover, these patterns are global, and that tells us that what we’re seeing is not just the result of erratic histories in place - certain groups fallen into strange relations with social services - but about the very fundamentals of how class, race/ethnicity, and poverty play out in society and the processes of social control and social ordering.\nThere must be personal commitments to unlearning racism and prejudice, critically examining whiteness, and learning how society is structured by race and class. Change requires courage and a willingness to confront and reflect on institutionalised injustices that practitioners, managers, policy makers and researchers are all caught up in and subjected to in their own lives. But responsibility must never fall solely on the shoulders of practice and practitioners.\nWe cannot naïvely assume that social workers can easily transition from current ways of working through (un)learning alone. Pursuing anti-oppressive practice makes social work more complex and more time consuming. Achieving it requires adequate resourcing of social services and investment in social work, as well as in allied causes and organisations, especially those led by people with lived experience of racism and class discrimination. It requires commitments to dismantling racism and the impact of structural inequality, not just the acknowledgment of it. And this must be done by all agencies and institutions: education, justice, welfare, and housing to name a few. If the police disproportionately target Black teenagers in areas that they ‘don’t belong’ for stops and searches, more ethnic disproportionality will emerge in social work. If schools in predominantly affluent, White areas, over-surveil their Black, Asian, and Mixed Heritage students, more ethnic disproportionality will emerge in social work.\nWhile the Black Lives Matter movement starts to see some success in their calls to defund the police and invest more into other services including social work, we must remember that social work hardly has a spotless record on racial equality, and many people do not know about the levels of ethnic disproportionality in family social work. Before I started researching children’s social services, I also held a rose-tinted view of social work. Restructuring systems of social control and order risks trading one form of oppression for another when the new system is not critically examined. If the social work profession wants to prove they deserve the trust of communities fighting for the rights of oppressed people, it needs to be upfront about its shortcomings and deliberate in its actions to confront them by moving towards social models of child protection.\nWe, as well as others, have exposed that inequalities in child protection are intersectional. We now need to see organisational and societal commitments to monitoring these intersectional inequalities and creating change, so that they are not allowed to retreat back to the shadows. In doing so, we must remember that nothing will change unless we can see it change. Be skeptical of words without action, action without results, and results without accountability and transparency. Only through vigilance will we keep a light on injustice, and in that light we can manifest change.\n\n\n\n",
    "preview": "https://calumwebb.co.uk/posts/2020-08-05-anti-racist-and-anti-poverty-social-work-must-be-both/img/CLA_infographicv2.png",
    "last_modified": "2021-08-02T15:44:19+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-08-02-cwip-app-v2-launch/",
    "title": "The Child Welfare Inequalities App Version 2: Now in Open Beta",
    "description": "Anyone can now use and test the Child Welfare Inequalities App version 2. This blog post provides a link to the new version of the app, plus a brief description of its features.",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-08-02",
    "categories": [
      "Social Work",
      "R",
      "cwip-app"
    ],
    "contents": "\nClick here to go directly to the CWIP App Version 2 Beta. For a brief overview, read on…\n\nIt’s been a year since I started working on the first version of the Child Welfare Inequalities Project App. The purpose of the app was to help social workers, policymakers, local government, activists - anyone, really - with the task of representing trends and patterns in, and pulling out basic statistics from, children’s services data. Anyone familiar with the statistical releases of the Department for Education will know that they are not always the most user-friendly files, they can be hard to combine, especially over time, and it can be hard for people with limited technical or statistical knowledge to extract the information they want from them. It is even harder to turn the data that’s extracted into something engaging, like a data visualisation, and this may take much more time than an activist or advocate might have. Quite frequently, the data is archived or requires some transformation, making comparisons over time difficult.\nThe CWIP App brings together around 16 different datasets at the local authority and neighbourhood level, with a range of features including being able to adjust for deprivation effects using the results from linear models calculated ‘on the fly’; the ability to compare multiple different graphs side-by-side; and the possibility to create literally hundreds of thousands of possible graphs. Moreover, in my opinion, these graphs look beautiful (while being informative as possible), and all have a consistent theme for non-jarring implementation into any organisations’ reports. All of this is done through a UI and hosted online, which means that nothing needs to be installed and no programming knowledge is required. The CWIP App is completely free, and has been funded by the University of Sheffield. All you need is an internet connection and a computer. You don’t even need to register for an account.\nVersion 1 of the CWIP App was my first attempt at building an R Shiny application and it was, to be blunt, very clear that it was my first time. It was well received, but there was consistent feedback about its limitations; many of which I didn’t have the technical skills to overcome. The code was full of redundancies (even more than this new one!), slow, and things like data storage and transformation were inefficient. In the space of a year, not only have the R community and Shiny resources grown, but my own experience and practice using it has, including when I developed the Mapping Overlaps Gadget (the features of which are replicated here). The offline and fully featured repository for version 1 included a 4.6GB data shapefile… The entirity of this version is around 0.75GB, while containing a huge number of additional variables, and is hosted publicly on Github, where anyone can download it.\nThis means that all of the code, all of the data, everything, can be examined, scrutinized, modified, extended, and used for whatever purpose anyone wants. You can use the app and its source code for education, practice, activism or management. And any graph you produce can simply be copy and pasted elsewhere, or for interactive plots there is a ‘download plot’ link.\nWith that introduction, let’s move onto the practical matter of what features are available…\nThe Data Dashboard allows you to quickly look at trends in variables from Section 251 returns, Children Looked After statistics, and the Children in Need Census…\n\nYou can pick from two different ways of visualising trends: as a simple trend plot, or as a bar showing the proportion of the funding in a local authority against the average in England. You can also get a sense of how these differences look on a map, what the variables’ relationship with deprivation looks like, and which local authorities have the most similar values on average or trends across time, by using the accompanying plot feature.\nSpending waffle charts are an interesting way to visualise how expenditure on children’s services has changed over time…\n\nThe waffle chart option allows you to visualise expenditure per child in any local authority over the last decade, as well as the English average. Spending is represented in £20 notes, and split into three categories: spending on children looked after, spending on safeguarding (including social work), and spending on Early Help/Family Support services. This visualisation is a good way to show not only how spending has increased or decreased over time, but how the proportions of spending have changed (for more detail on this, see our paper).\nSide-by-side trend plots allow you to investigate how trends have been changing over the past decade…\n\nYou can also use this feature to compare how a trend might look if all local authorities had the same underlying level of deprivation, compared to how it looks with the underlying structural inequalities we currently have. Often, when underlying need is equalised you can find interesting sites for comparison, and in our research we’ve found that as much as 75 per cent of the variation in LA rates of intervention can be explained by underlying differences in deprivation.\nIn a similar vein, you can compare two maps side by side…\n\nYou can compare distributions of the same or different variables across the country using side-by-side maps. This can be handy for comparing distributions and changes across two time periods (if you select two different time periods, the scale will be set to the same for both), or looking at how distribution would be different if all local authorities had the same underlying deprivation. For example, there are usually more children looked after in rural and southern local authorities once the effect of deprivation is removed. You can even change the map to a Danny Dorling style cartogram, so that each local authority is represented based on the size of their child population (rather than their landmass!)\nThe app also visualises how staggering ethnic inequalities are in rates of children in care…\n\nSeveral graphs can be produced which illustrate the scale of ethnic inequalities at the local authority level, showing not only the rates of intervention per estimated 10,000 of the ethnic population, but how those look in proportion to the intervention rates for the White British population.\nCluster and Trend Cluster plots perform Hierarchical Cluster Analysis in your browser, to identify which local authorities are the most similar to one another…\n\nYou can cluster local authorities based on their similarity across any combination of variables in the CIN Census, CLA statistics, and S251 Returns. For example, you can find who had the most similar rates of children looked after to one another as well as the most similar levels of spending and referrals on average across the decade, or in one specific year. You can also cluster based on trends, for example, to find out which local authorities had seen similarly steep reductions in spending under austerity. The distance of the lines linking two local authorities reflects how dissimilar they are (roughly speaking).\nThe features from the MOG app also exist in the CWIP App version 2…\n\n\nUsing these, you can explore between 50 and 100 small area level variables within local authorities (at the children’s services administrative boundary). You can even overlay two variables to explore interesting intersections, for example, neighbourhoods with high levels of income deprivation but low levels of education, employment, and skills deprivation. These might be interesting sites to learn about how to improve services and support.\n\n\n\n",
    "preview": "posts/2020-08-02-cwip-app-v2-launch/img/cwip-app-v2-launch/img1-prev.png",
    "last_modified": "2021-08-02T15:55:32+01:00",
    "input_file": {},
    "preview_width": 1055,
    "preview_height": 1055
  },
  {
    "path": "posts/2020-07-29-ethnic-inequalities-in-local-authority-children-looked-after-rates-cwip-v2-preview/",
    "title": "Ethnic Inequalities in Local Authority Children Looked After Rates (CWIP v2 Plots Preview)",
    "description": "Charts that show how unequal children looked after rates appear to be across ethnic groups in local authorities in England.",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-07-29",
    "categories": [
      "Social Work"
    ],
    "contents": "\nThe following are some charts that are created with a function that forms a new part of the Child Welfare Inequalities Project App. You can read our research on ethnic inequalities in intervention rates here (Open Access). We have just had a new article accepted in Children and Youth Services Review that extends this work further with intersectional population models, look out for an announcement on Twitter for when this is published.\nRanges are not set equal across all plots\n\n\n\nThere is a strong relationship between CLA rates and deprivation for White British child populations\n\n\n\nRates for Mixed Heritage child populations are about twice as high in an average LA, and are also strongly associated with deprivation\n\n\n\nAsian population rates are typically much lower, but this is not always the case. Our research has shown that this also differs quite substantially depending on whether you’re looking at rates for children with Bangladeshi, Pakistani, or Indian heritage.\n\n\n\nRates for Black children are almost 4 times higher than White children, on average. But there are some huge outliers, which can be seen at the bottom of the chart; these may be outliers related to unaccompanied asylum seekers, or due to poor population projections given the census is so out of date. The rates also seem to be less strongly associated with deprivation than the White British or Mixed Heritage rates.\n\n\n\nThe rate ratio plots show how the majority of local authorities have CLA rates for Mixed Heritage child populations that are higher than the rates for their White British population. On average, for every 1 White British child in care per 10,000 White British children we would expect to see around 2.16 Mixed Heritage children in care for every 10,000 Mixed Heritage children.\n\n\n\nThe rate ratio plots show how the majority of local authorities have CLA rates for Asian populations that are lower than the rates for their White British population. On average, there are around 0.6 Asian children in care for every 10,000 Asian child population for every 1 White British child in care for every 10,000 White British children.\n\n\n\nAgain, we see the strongest ethnic inequalities reflected in the Black child population, where we’d expect a CLA rate for the Black child population around 3.7 times higher than the White British rate per 10,000, on average.\n\n\n\n",
    "preview": "posts/2020-07-29-ethnic-inequalities-in-local-authority-children-looked-after-rates-cwip-v2-preview/img/eth_plots/preview.png",
    "last_modified": "2021-08-01T18:01:41+01:00",
    "input_file": {},
    "preview_width": 691,
    "preview_height": 691
  },
  {
    "path": "posts/2020-06-20-more-evidence-needed/",
    "title": "'More evidence needed...' Pessimism of a sociologist in the age of justice procrastination.",
    "description": "How much time do you want for your progress?",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-06-20",
    "categories": [
      "sociology"
    ],
    "contents": "\n\n‘What is it you’re wanting me to reconcile myself to? I was born here almost sixty years ago. I’m not going to live another sixty years. You always told me it takes time. It’s taken my father’s time, my mother’s time. My uncle’s time. My brothers’ and my sisters’ time. My nieces’ and my nephews’ time. How much time do you want for your “progress?”’\nJames Baldwin, The Price of a Ticket\n\nAt several points in my very short career I have written sentences in drafts of academic journal articles that feel wrong, but not in an empirical sense. My stomach crumples and contorts in panic as I review or think about what I’ve written, like someone is tilting the cartridge of my soul. It’s the result of going against the deep desire to doubt myself, to convince imaginary detractors who, at the sniff of insurrectionary sentiment, will dismiss whatever points I might have made as the ramblings of a revolutionary. Not ‘proper’ science. I back off to the safe comfort of concluding that ‘this research has its limitations and more data is needed’.\nThe first clear sense of this feeling came from about as milquetoast a sentiment that has ever been written. In a concluding section of an article I wanted to express that children and young people were especially disadvantaged in the policy sphere because they could not vote, they had no meaningful representation, and were easy to target because they are unable to hold anyone accountable. And that, as a consequence of this, it was our responsibility to amplify their voices and draw attention to the injustices they faced.\nIn the end, I pissed away the chance to express this argument clearly by reiterating some statistics and hoping the reader would come to the conclusion I was alluding to. Like some kind of academic ‘nudge-nudge, wink-wink’. I had a sense that such things could not be said if I wanted to be taken seriously. “Children’s services have been cut more than any other service and, well - you know - it’s really not on now, is it chaps?” Epistemological Victorianism.\nPerhaps this is just a problem with me - the gutless subversive. But I feel that it goes deeper than that. There is a sense, in research and writing about research, that every finding that implies there should be a change against the status quo must be qualified with ‘but of course, more evidence is needed before we actually do anything about this’. Always ‘more evidence is needed’.\nOf course, a certain amount of this is self-preservation from an existential threat. If we don’t need any more evidence, what’s the point of me? But I feel it goes much deeper than that. We’re told that this is the way to make progress. That, if we follow the rules, do everything carefully, correctly, scientifically, then incremental change is not only logical but inevitable.\nBut the world only changes with the facts when ignoring them any longer would threaten those who benefit from the status quo. When the political ground of inaction becomes more unstable than that of action, and even then it only changes as much as needed to stop the shaking. The quantity of evidence, the quality of evidence, none of it matters much on the treadmill of justice procrastination.\nWe are kept busy collecting evidence that can be conveniently pointed to as a reason for social change to hide the fact that most of the time the only barrier to change was that the people in charge could get away with not doing it. No politician has ever sat in front of the jigsaw of policy saying ‘Yes, we must do something, but I just need that last piece of evidence!’, but they will happily say ‘Well, we hadn’t done anything about it before but in light of this new evidence…’ In many cases, the evidence has existed for years and the ‘new evidence’ becomes a convenient retrospective excuse for inaction rather than a catalyst for action.\nThere’s perhaps no better example of this than Marcus Rashford’s campaign that succeeded in creating a U-turn on government free school meals policy. Rashford’s success put the collective efforts of many social scientists over at least the last decade to shame. That is not a criticism of them, but of the relationship between evidence and politics. While people outwardly celebrated the success, I imagine many behind closed doors, myself included, felt pathetically ineffective. Some things we don’t need more evidence about. We don’t need more evidence to prove that allowing children to starve is wrong and harmful.\nI’m afraid I don’t have a satisfying conclusion to this post. I don’t have a suggestion or solution. Less trepidation in our writing and more activism, I suppose, but even that feels like a cop out when faced with systemic indifference to evidence. And, as I say, maybe this is more of a ‘me’ problem than an a ‘we’ problem.\nI would probably start by asking myself one thing every time I feel tempted to write that more evidence is needed, riffing off of the James Baldwin quote above. ‘How much evidence do you want for your progress?’ Evidence is time. Can-kicking progress and agreeing to a few more minutes on the treadmill. Most of the time more evidence isn’t needed, other than for us to justify the existence of our jobs.\n\n\n\n",
    "preview": "posts/2020-06-20-more-evidence-needed/baldwin-prev.png",
    "last_modified": "2021-08-02T15:58:15+01:00",
    "input_file": {},
    "preview_width": 674,
    "preview_height": 674
  },
  {
    "path": "posts/2020-06-06-citations-grabber/",
    "title": "Citations Grabber",
    "description": "Adventures into automating my CV and creating a tool for collating citations from Google Scholar and education and employment details from ORCID.",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-06-06",
    "categories": [
      "R"
    ],
    "contents": "\n\nPresumably the anxiety stored somewhere in my unconscious has prompted me to spend this weekend automating the process of adding publications, citation statistics, and employment and education details to my CV, as well as implementing a system where things like teaching, reports not tracked by Google Scholar, and other miscellaneous bobbins can be stored more easily in a database, ready to be updated and sorted.\nI quite like the end result, which you can see using the Resume/CV link above. Such an innocuous project also gave me an excuse to break through the barrier of imposter syndrome with relation to ‘being a non-coder just playing at coding’ - whose ugly and poorly functional code would be easily torn to pieces - and make a github account. The code for the CV itself can be found here. It shouldn’t be too difficult to adjust to your own profile by changing the ORCID id and the Google Scholar ID.\nIn the process, I also created a little gadget to grab the bibliography and cumulative/yearly citation record of anyone with a Google Scholar profile. Unfortunately, Google’s ToS mean that I can’t host this application online (well, I can, but it doesn’t work). However, you can find the source code for it here and a few screenshots of it in action below. You can download or clone the repository to run it on your machine, in which case you can use it to your heart’s content. There is even an easter egg if you enter the Google Scholar ID of my head of department…\n\n\n\n\n",
    "preview": "posts/2020-06-06-citations-grabber/img/cv_new.png",
    "last_modified": "2021-08-02T13:47:22+01:00",
    "input_file": {},
    "preview_width": 1986,
    "preview_height": 1308
  },
  {
    "path": "posts/2020-04-26-policy-and-practice/",
    "title": "Policy and Practice or Structural Inequality? Challenging the popular interpretation of the NAO's 2019 report on pressures on children's social care.",
    "description": "A common myth that seems to stem from interpretations of the NAO's analysis of children's social care is that most differences between local authorities are down to local policy and practice, and that structural disadvantage explains comparatively little. Our research challenges this interpretation.",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-04-26",
    "categories": [
      "Social Work"
    ],
    "contents": "\n\nBack in January 2019, the National Audit Office published a report which claimed that 44 per cent of the variance in Local Authority Child Protection Plans could be explained by ‘local authority characteristics’ other than deprivation (which could explain 15 per cent). Although they never claimed this, the finding was largely interpreted as evidence that local authority policy and practice was more important than structural disadvantage - by some magnitude. However, an analysis by myself and colleagues of the Child Welfare Inequalities Project recently published in Children and Youth Services Review found that, once deprivation and other structural factors are accounted for at the neighbourhood level, differences between local authorities shrink dramatically and in some instances practically disappear.\nThe Nuffield Foundation funded a modest extension to our original project to use some more complex modelling techniques on the data we had collected from 18 systematically chosen local authorities. These local authorities were chosen to be a representative sample of all local authorities in England, reflecting many different regions and varying levels of deprivation and ethnic makeup. For this analysis we aggregated Childen in Need, Child Protection Plan and Children Looked After records up to the Lower Super Output Area level and joined several LSOA measures onto this data. An LSOA can be thought of as a large ‘neighbourhood’, with around 1,500 people living in it. This contrasted to the NAO’s approach which, although not made transparent, seemed to use far less granular data.\nOur paper focused mostly on the magnitude of structural inequalities and the size of the Inverse Intervention Law and the Inequalities Intervention Law, but the technical appendices also contained measures of variance linked to neighbourhood local authority membership and how these changed after controlling for different structural factors. It’s these measures that I want to expand upon here, because I believe they are important for the ongoing ‘Policy and Practice’ versus ‘Structural Disadvantage’ narrative that appears so frequently.\nHow does local authority variation change before and after controlling for structural factors?\nUsing a multilevel model we were able to get a measure of local authority level variation in average neighbourhood rates of child welfare interventions. A simple explanation of this is that we calculated how much each local authority’s average neighbourhood rates of intervention differed. Before we take account of any structural factors, like deprivation or ethnicity, the variation for local authorities comes out as 0.1047. This is a ‘raw’ amount of variation between local authorities. We can get a sense of what this means if we plot all of these variations around the mean rates.\n\nIn the plot above we can see our model’s predictions for each of our 18 local authorities. The green line represents the average CPP rate across all local authorities (around 39 plans per 10,000 children). The points below the green line are local authorities with average neighbourhood rates below the average, and the points above the green line are those with higher than average rates. As you can see, there is a lot of local authority variance - some have average neighbourhood CPP rates approaching 60 children per 10,000, others have rates lower than 25 per 10,000. Surely we should rush to the local authority with much lower rates in their neighbourhoods to find out how their policies and practice differs, right?\nBefore we do so, let’s have a look at how our local authority variance changes once we control for structural factors. Structural factors are societal things that influence outcomes - like peoples’ health or exposure to risks or advantages. They are unequally distributed across local authorities, so what might look like a difference caused by local authority membership (and something specific about how that local authority does things) might actually be representing differences in structural dis/advantage. Esssentially, if we switched around the structural inequalities in local authorities we would expect the outcomes to switch around too, regardless of the local authority we’re switching from/too. The full list of structural inequalities we included in our model were:\nNeighbourhood deprivation\nLocal Authority deprivation\nEthnic density of different ethnic groups\nUnemployment levels\nInfant Mortality\nPopulation education levels\nIncome inequality\nThe ‘inverse intervention law’ and the ‘inequalities intervention law’\nThe last two structural factors require some explanation. We observed in earlier research that deprivation had a different relationship with child welfare interventions depending on how widespread deprivation was in the wider area. We also found that the same thing happened with income inequality. In short, deprivation was more strongly linked to child welfare interventions in less deprived, more unequal local authorities. So what happens to our local authority variance after we control for all of these factors?\n\n\nThe variance linked to local authority membership shrinks, from 0.1047 to 0.0039. You can see by comparing the two plots that the differences in the mean neighbourhood CPP rate linked to LA membership reduce quite remarkably after controlling for structural factors. Yes, there are still some differences we might want to investigate, but these were greatly exaggerated by a lack of structural awareness in our model. The difference between the local authority with the highest intercept is now less than double that of the local authority with the lowest intercept (by contrast, children in the most deprived 10% of neighbourhoods were over 10 times as likely to be on a child protection plan than children in the least deprived 10%)\nSo far this post has focused on child protection rates, but the differences are more profound when we look at other intervention measures like Children Looked After rates. Looking at the plots below, you can see how local authority variance practically disappears in average neighbourhood Children Looked After rates after we control for the same structural factors. Efforts to reduce local authority differences in Children Looked After rates are doomed to fail if they ignore structural contexts of poverty and ethnic inequality.\n\n\n\n\n\nShould we ignore local authority differences in policy and practice?\nNo. Our interpretation of the findings should not be as simplistic as that. There are clearly some differences in certain practice areas, however overstated these may be when we aggregate data up as far as the local authority level. Furthermore, the Inverse Intervention Law and the Inequalities Intervention Law demonstrate that the same structural disadvantage can result in very different child welfare inequalities depending on the local authority context, which we explored in more detail in our published paper.\nWhat the evidence does suggest is that it is misleading and incorrect to claim the majority of differences in child welfare inequalities are down to local authority policy and practice.\nOur research shows that what is important is the space where local authority policy and practice meets structural inequality; how well local children’s services can respond to, alleviate, and challenge structural disadvantage, and the extent to which structures can support and enable positive local policies and practice. It is not a case of one or the other, structural disadvantage or practice and policy, but both in relation to one another. As such, the most effective changes to children’s services are likely to be found in those approaches that merge effective child protection policy and practice within a structural inequalities perspective.\nThis post was written by me in a personal capacity and does not necessarily represent the views of the wider CWIP team nor of our funders or employers.\n\n\n\n",
    "preview": "posts/2020-04-26-policy-and-practice/big-dog-little-dog.jpg",
    "last_modified": "2021-08-02T18:15:36+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-04-25-the-biggest-problem-with-the-funding-formula/",
    "title": "The biggest problem with the funding formula for Children's Social Services isn't that it's too inequitable, it's that it's too relative.",
    "description": "It is a mathematical fact that the larger the gap between the resources needed and the resources provided is, the more inequitable a relative funding formula becomes, regardless of how accurate its proportioning is.",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-04-25",
    "categories": [
      "Social Work"
    ],
    "contents": "\nPhoto from Unsplash\nIn 2018, Paul Bywaters and I published a paper about the funding of children’s services under the austerity years of the coalition government (open access repository version here). The headline finding from this research was that the term ‘decimated’ was a huge understatement for describing what had happened to funding for family support and early help between 2010 and 2015. Resources available to local authorities for providing these services could more accurately be described as having been obliterated, and that the cuts were far worse in the most deprived local authorities.\nA finding that received less attention was that the funding formula for children’s services had not only been simplified, but had been quietly changed from something with more ‘absolute’ components to a purely ‘relative’ formula. Before 2012, the formula used a way of determining funding that multiplied specific amounts by needs-related factors in a local authority (DCLG, 2010: 7-10). Despite calling itself a ‘Relative Needs Formula’ and having an upper ceiling on funding, this reflected a far more absolute level of need in each local authority.\nAfter 2012, amongst other direct cuts, the funding formula was made more relative, where the proportion of a local authorities level of need relative to other local authorities was calculated first before being multiplied by the total grant funding available, obscuring the real amount of need that would go unmet (DCLG, 2013: 45-47). To our knowledge, these changes flew mostly under the radar. Perhaps because local government financing is hardly the most thrilling of tasks.\nBaking the pie and slicing the pie: the difference between relative and absolute approaches to funding\nImagine for a moment that each local authority is a dinner guest, the need for children’s services is their level of hunger, and the funding of these services is a pie. The DCLG and Treasury, in this instance, play the role of the baker.\nAn absolute formula is primarily concerned with creating a large enough pie that every guest’s hunger is sated equitable to their level of hunger. If the first guest says that 800g of pie is enough to satisfy their hunger, another that 400g is enough, and a third that believes 200g would suffice, the baker will create a pie that weighs 1,400g in total and then distribute it according to each person’s reported hunger - guest one gets 800g of pie, guest two gets 400g, and guest three gets 200g. In this form, the formula serves the purpose of informing the baker of how much pie is needed and how it should be distributed. It equitably satisfies the needs of the table.\nIn a purely relative formula, the only concern is apportioning a pie of pre-defined weight to the same people. The size of the pie is already decided. Regardless of whether the requested amounts are 800g, 400g, and 200g or 1,600g, 800g, and 400g, each of our dinner guests will receive an identical amount of pie should the proportions stay the same, even if in the latter context it is clearly insufficient to satisfy their hunger. The only concern is each guest’s hunger relative to the others, not the total hunger around the dinner table. The only thing that matters in a purely relative funding formula is the slicing of the pie, not the baking, and making sure everyone leaves feeling well-fed plays no part in your decision on how much you’re going to cook.\nFurther, this relative approach will do less not more to satisfy the hungriest of our guests. If the pie were a predefined 1,000g split in a 8:4:2 ratio the hungriest of our guests would received around 570g of pie (230g less than their hunger requires) and the least hungry would receive around 140g (60g less than their reported hunger requirement). The person most in need of pie (insofar as anyone is in need of pie) is the most disadvantaged by the relative approach. This is the same reason why we found the most deprived local authorities had been the most disproportionately affected by funding cuts.\nFixing the funding formula\nThis is the biggest problem in the funding of children’s services. Efforts to improve equitability of funding are laudible, but will never improve the position of children’s services if they remain linked to a purely relative funding formula. A more fundamental question needs to be asked about the purpose that a funding formula serves. Yes, it should equitably distribute funding to those most in need, but this should not be its primary purpose.\nThe purpose a funding formula should serve is to gauge the total need for services, calculate how much this should cost to meet, and ensure that adequate funding is in place to meet this need. Should the political will - and it is a lack of political will, not a lack of economic means - to fund services to the required amount fall short we must know explicitly how short it has fallen by.\nThe further we refuse to engage with the absolute amount of funding that is required to meet the needs of communities, the more harm we cause. It is a mathematical fact that the larger the gap between the resources needed and the resources provided is, the more inequitable a relative funding formula becomes, regardless of how accurate its proportioning is.\n\n\n\n",
    "preview": "posts/2020-04-25-the-biggest-problem-with-the-funding-formula/dog-pie.jpeg",
    "last_modified": "2021-08-02T16:02:06+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-04-20-visualising-the-villagers/",
    "title": "Poster: Visualising the Villagers, datavis meets Animal Crossing",
    "description": "Which animal crossing villagers look most alike? Which villagers are the most popular? What personality types are most common for each species and how do they like their coffee?",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-04-20",
    "categories": [
      "R"
    ],
    "contents": "\nAs many have pointed out, the release of the anticipated Animal Crossing: New Horizons coincided with with the COVID-19 pandemic. Like many others I’ve been enjoying the experience of building an island paradise for my animal villagers, but I had to find something to do while waiting for my money rock to respawn, my fruits to regrow, and my bridges to be built.\nOver the last week I’ve been scraping data from various Wikis and fan sources to put together a set of visualisations about the animals that inhabit the many digital islands. You can see the result below (extra large image available here.) The dendrogram in particular made use of a very interesting package in development called cuttlefish. I’ll try to write some posts in the near future showing how to create each of the plots in the poster.\n\n\n\n\n",
    "preview": "posts/2020-04-20-visualising-the-villagers/ac_datavis_plot_preview.png",
    "last_modified": "2021-08-02T16:05:02+01:00",
    "input_file": {},
    "preview_width": 1586,
    "preview_height": 1586
  },
  {
    "path": "posts/2020-01-22-spotifyr/",
    "title": "Tidy Tuesday 21/01/2020: Spotifyr. Hierarchical clusters of popular songs by audio features",
    "description": "Using audio features to create \"perfect pairings\" of popular songs? Pretty dendrograms using ggdendro.",
    "author": [
      {
        "name": "Calum Webb",
        "url": {}
      }
    ],
    "date": "2020-01-22",
    "categories": [
      "tidytuesday"
    ],
    "contents": "\n\nPlaylist: https://open.spotify.com/playlist/3kPYr4522CKURLg4ePkuz1?si=3Yx-APApQL2s4KsvFFskAQ\n\nPlaylist: https://open.spotify.com/playlist/18qGN481uKhPCbBy0UHz1i?si=l5jqQlb0R5WD8HYv9UVIlA\n\nPlaylist: https://open.spotify.com/playlist/4ChD4YncnVzSK7E8Z8wn3W?si=JCJUSe55TNGREQ1q0QF9CQ\n\nPlaylist: https://open.spotify.com/playlist/2kdfe1C6wSRkNxhrEyIVOP?si=QRJbJofnRUyvib-_U4GSvA\n\nPlaylist: https://open.spotify.com/playlist/3FnznOoaA2lnDr7wIT0j5Q?si=lgcYDNeDSau2nnP0_ID92w\n\nPlaylist: https://open.spotify.com/playlist/7nwVFzZ67qgu1VddrbpQ5K?si=cWn4yU4pRj-k8H37icWRog\nPlaylists created using spotipy.\nThis was my attempt at creating an appealing (although maybe not super informative) visualisation of popular songs from the Spotify data in this week’s Tidy Tuesday.\nIf I was using my statistical routes, I would just describe this as a dendrogram with polar coordinates showing the results from a hierarchical cluster analysis based on several audio features: danceability, energy, loudness, speechiness, acousticness, instrumentalness, liveness, valence, and tempo. The descriptions of each can be found in the link above.\nIf I was trying to market myself and the visualisation better I would say something incorrect but eyecatching like: Using AI to Choose Perfect Pairings of Songs.\nDescribing the visualisation\nThe visualisation above is made of two parts: a polar coordinates scatterplot showing the relative high and low features of each song in terms of its tempo, valence, acousticness, speechiness, loudness, energy, and danceability (from the outermost to the innermost circle). That means that, for example, songs with large diamonds on the outermost circle have the highest tempos, songs with small or no diamonds have the lowest. Songs with larger diamonds in the next circle inwards are relatively happier or cheerful. And so on.\nThe second part of the visualisation is the ‘tree branches’ that go from the outside in. At the lowest level, each one of these branches (the twigs) is linked to only this song. The two songs with the most similar audio features are then linked together in the next branch up, and then these pairs are linked to the next song or pair of songs. This continues until all of the songs are linked.\nThis type of graph is called a dendrogram, and we usually see them in evolutionary biology. For example, below is a dendrogram from the Institute of Canine Biology showing the similarities between different dog breeds.\n\nCode for creating data visualisation\nRather than breaking down each part of the code below I’m just going to outline the reasons behind each part:\nFirst I read in the data and remove the duplicates using a combination of track name and artist. Then I filter out the genre that I want to create the visualisation for. The real upper limit for a plot like this is around 200 data points, especially when song names are long. Lastly I create a new variable that takes the track year from the album release date (it extracts the first four characters of the string and makes the result a numeric type column)\nNext, I found from playing around that the popularity skewed way too heavily towards more recent releases. To try and remedy this a little I used a linear model with release year included as a set of dummy predictors, with 2019 as the reference year. I use broom to tidy up the results of this model and then get the track years back from the term column to use for a join later on. I then subtract those coefficients to rebalance the popularity by adjusting for the average drop in popularity in years past. I find this gives a much better view of “most popular, timeless” songs that makes be feel less old. Finally, I rank the tracks and keep only the top 200 - I accept any of the ties as well so it’s sometimes more or less than 200.\nNext we create a data frame that can be used to calculate a distance matrix, calculate said matrix, and run a hierarchical cluster analysis. We then extract the clusters and get them in a format that can be handled by ggplot using the amazing ggdenro package.\nNext there is a bunch of fiddly stuff to get the angles on the text labels correct and to specify a nice neon colour palette for the feature plotting. I also need to set constants to put the feature rings in the right place on the plot (which required going back to the axis scale a few times).\nLast fiddly things are to set quantiles for each of the audio feature variables and add an empty row and point to stop the overlap that seems to often happen at the start and end of the plot (both at 12’o clock). This makes the variation more visible (you’ll see I also experimented with just scaling the variable, but the differences are too obscured at such a small size).\nFinally we can plot the data. Note the important polar coordinates and reverse y scale arguments. Also note that I’ve set a very small limit for the amount that size is allowed to fluctuate (for the audio feature rings). The largest feature data points still need to be quite small to look nice and be informative.\nThe full code for the EDM visualisation is below: you can change what genre is visualised by just changing the filter conditions at the start of the code chunk.\n\n\n# Script v2 extended and with year of release weighting\nlibrary(tidyverse)\nlibrary(ggdendro)\nlibrary(broom)\nlibrary(mltools)\n\n# data\nspotify_songs <- readr::read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-01-21/spotify_songs.csv')\nunique(spotify_songs$playlist_genre)\n\nspotify_songs\n\n\n# Filter out duplicates and select genre, extract year, remove zero popularity songs\nspotify_songs <-  spotify_songs %>% \n  filter(!duplicated(paste(track_name, \" - \", track_artist))) %>% \n  filter(playlist_genre == \"edm\" & track_popularity > 0) %>% \n  mutate(\n    track_year = as.numeric(str_extract(track_album_release_date, \"^.{4}\"))  \n  )\n\n# Weight track popularity by year of release using linear model\nedm_model <- lm(data = spotify_songs, \n                formula = track_popularity ~ I(relevel(as.factor(track_year), ref = \"2019\")))\nedm_model <- tidy(edm_model) %>% \n  mutate(\n    year = ifelse(str_detect(term, \"Intercept\"), 2019, as.numeric(str_sub(term, -4, -1))),\n    year_weight = ifelse(str_detect(term, \"Intercept\"), estimate, estimate)\n  )\nspotify_songs <- left_join(spotify_songs, edm_model %>% select(year, year_weight), \n                           by = c(\"track_year\" = \"year\")) %>%\n  mutate(\n    weighted_popularity = ifelse(track_year != 2019, \n                                 track_popularity - year_weight, \n                                 track_popularity)\n  )\n\n\n# Filter the top 200ish songs by year of release weighted popularity\nspotify_songs <- spotify_songs %>% \n  mutate(track_rank = rank(-weighted_popularity)) %>% \n  filter(track_rank < 200)\n\n\n# Create distance matrix based on danceability, energy, loudness, mode, speechiness, acousticness\n# instrumentalness, liveness, valence and tempo\nspotify_songs_distdata <- as.data.frame(spotify_songs)\nrownames(spotify_songs_distdata) <- paste0(spotify_songs_distdata$track_artist, \" - \", spotify_songs_distdata$track_name)\n\n# Filter out only variables to predict on\nspotify_songs_distdata <- spotify_songs_distdata %>% \n  select(danceability, energy, loudness, mode, speechiness,\n         acousticness, instrumentalness, liveness, valence,\n         tempo)\n\n# Distance matrix\ndist_spotify <- dist(spotify_songs_distdata)\n\n# Hierarchical cluster\nclusters_spotify <- hclust(dist_spotify)\nclusters_data <- as.dendrogram(clusters_spotify)\n\n# Dendro data conversion for plotting with ggdendro\nclusters_data_ggd <- dendro_data(clusters_data, type = \"rectangle\")\nseg_data <- segment(clusters_data_ggd)\n\n\n# Calculate angles and orientation for label placement\nnumber_of_bar <- nrow(clusters_data_ggd$labels)\nangle <-  90 - 360 * (as.numeric(rownames(clusters_data_ggd$labels)) - 0.5) / number_of_bar\nclusters_data_ggd$labels$hjust <- ifelse( angle < -90, 1, 0)\nclusters_data_ggd$labels$angle <- ifelse(angle < -90, angle+180, angle)\n\n# Add layers with data on other variables\nlabel_data <- as_tibble(clusters_data_ggd$labels)\nlabel_data <- label_data %>% mutate(\n  danceability_y = 8, # most inner\n  energy_y = 7.66, \n  loudness_y = 7.33, \n  speechiness_y = 7, \n  acousticness_y = 6.66, \n  valence_y = 6.33, \n  tempo_y = 6 # most outer\n)\n\n# edm colour scheme: \nedm_col_scheme <- colorRampPalette(c(\"#00A6D7\", \"#86FAF2\"))(7)\n\nlabel_data <- left_join(label_data, as_tibble(spotify_songs_distdata, rownames = \"label\"), by = \"label\") %>%\n  mutate_at(vars(danceability:tempo), scale) %>%\n  mutate_at(vars(danceability:tempo), ~ntile(., 10))\n\n# Add a dummy empty row for space at the top of the plot to avoid label clash\nendpoint_data <- as.tibble(seg_data %>% filter(yend == 0)) %>% add_row(yend = 0, x = max(seg_data$x) + 1)\nclusters_data_ggd$labels <- clusters_data_ggd$labels %>% add_row(label = \"\", x = max(clusters_data_ggd$labels$x) + 1, y = 0, hjust = 0, angle = 90)\n\n# Plot circular dendrogram with acoustic features in centre for most edmular 200 release year weighted \n# edm songs\nedm_plot <- ggplot(seg_data) +\n  geom_segment(aes(x = x, y = log(y+1), xend = xend, yend = log(yend+1)),\n               alpha = 0.6,\n               col = edm_col_scheme[7]) +\n  geom_point(data = endpoint_data,\n             aes(x = x, y = log(yend+1)),\n             col = edm_col_scheme[7]) +\n  geom_text(data = clusters_data_ggd$labels,\n            aes(x=x, y= log(y+1) - 0.3, label = label, hjust = hjust), \n            size = 1.8,\n            angle = clusters_data_ggd$labels$angle, inherit.aes = FALSE,\n            col = edm_col_scheme[7]) +\n  # feature layers ordered from inner to outer\n  geom_point(data = label_data,\n             aes(x = x, y = speechiness_y, size = speechiness), \n             col = edm_col_scheme[4], stroke = 0, alpha = 0.99, shape = 18) +\n  geom_point(data = label_data,\n             aes(x = x, y = loudness_y, size = loudness), \n             col = edm_col_scheme[5], stroke = 0, alpha = 0.99, shape = 18) +\n  geom_point(data = label_data,\n             aes(x = x, y = acousticness_y, size = acousticness), \n             col = edm_col_scheme[3], stroke = 0, alpha = 0.99, shape = 18) +\n  geom_point(data = label_data,\n             aes(x = x, y = energy_y, size = energy), \n             col = edm_col_scheme[6], stroke = 0, alpha = 0.99, shape = 18) +\n  geom_point(data = label_data,\n             aes(x = x, y = valence_y, size = valence), \n             col = edm_col_scheme[2], stroke = 0, alpha = 0.99, shape = 18) +\n  geom_point(data = label_data,\n             aes(x = x, y = danceability_y, size = danceability), \n             col = edm_col_scheme[7], stroke = 0, alpha = 0.99, shape = 18) +\n  geom_point(data = label_data,\n             aes(x = x, y = tempo_y, size = tempo), \n             col = edm_col_scheme[1], stroke = 0, alpha = 0.99, shape = 18) +\n  # annotate(\"text\", x = 0, y = 8, label = \"edm\", col = \"#FE1D6B\", size = 12, \n  #          alpha = 1, vjust = 1.5) +\n  coord_polar(start = 0) + \n  scale_y_reverse(limits = c(8, -10), \n                  expand = c(0.2, 0)) +\n  scale_size(range = c(0.1, 1.5)) +\n  theme_minimal() +\n  theme(\n    axis.text = element_blank(),\n    axis.title = element_blank(),\n    panel.grid = element_blank(),\n    plot.background = element_rect(color = \"black\", fill = \"black\"),  \n    panel.background = element_rect(fill = \"black\", color  =  NA),\n    text = element_text(family = \"Helvetica\"),\n    legend.position = \"none\"\n  )\n\n# # - not run\n# # Save plot \n# ggsave(\"edm_dendro.tiff\", dpi = \"retina\", width = 10, height = 10, units = \"in\")\n# ggsave(\"edm_dendro.png\", dpi = \"retina\", width = 10, height = 10, units = \"in\")\n\n\n\n\n\n\n\n\n\n",
    "preview": "posts/2020-01-22-spotifyr/rock_poster_preview.png",
    "last_modified": "2021-08-02T16:07:50+01:00",
    "input_file": {},
    "preview_width": 1816,
    "preview_height": 1816
  }
]
